---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConnectorName(System.Int32)
source: html/eee278fa-1961-c38a-b1a7-df0af1472896.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConnectorName Method

Gets the fabrication connector name from its identifier.

## Syntax (C#)
```csharp
public string GetFabricationConnectorName(
	int fabricationConnectorId
)
```

## Parameters
- **fabricationConnectorId** (`System.Int32`) - The fabrication connector identifier.

## Returns
The fabrication connector's name.